*Prepared for the course "TDPS22: Data Science Programming" at Jönköping University, Teacher: [Marcel Bollmann](mailto:marcel.bollmann@ju.se)*

# Exercise 1: Practice your Pandas skills!

This notebook contains exercises on data exploration and transformation using the Pandas library.  It does **not** directly follow the book or user guide, but rather contains exercises that are practically motivated and require a wide variety of Pandas functionality.

### Learning Goals

- Understand how to think about data manipulation & analysis in Pandas.
- Know how to use _indexing, smart indexing, and aggregations_ in Pandas.
- Know how to use _grouping operations_ in Pandas.
- Know how to _combine_ datasets in Pandas.

Remember that you don't need to learn everything by heart; it's okay to need to look up things, but you should become more proficient in the basic principles & techniques needed to solve exercises like these.

### Useful Resources

- [_Python Data Science Handbook_ by Jake VanderPlas, Ch.3: Data Manipulation with Pandas](https://jakevdp.github.io/PythonDataScienceHandbook/index.html#3.-Data-Manipulation-with-Pandas)
- [Pandas User Guide](https://pandas.pydata.org/docs/user_guide/)

The datasets used here contain _synthetically generated_ (i.e., fake) data which is based on, but not identical to, the ["Coffee Chain" dataset from Kaggle](https://www.kaggle.com/datasets/qusaybtoush1990/coffee-chain).

In [1]:
%load_ext rich
import pandas as pd

The rich module is not an IPython extension.

In [2]:
# Load the data into a Pandas DataFrame
data = "data/coffee-chain.csv"
df = pd.read_csv(data)
df

,Ddate,Market,Product,Product Type,Sales,Profit,Expenses
0,9/1/13,Central,Decaf Irish Cream,Coffee,90,36,37
1,5/1/12,East,Decaf Espresso,Espresso,203,56,55
2,1/1/13,West,Caffe Latte,Espresso,524,136,93
3,8/1/12,West,Earl Grey,Tea,273,81,68
4,12/1/13,West,Amaretto,Coffee,201,-3,68
...,...,...,...,...,...,...,...
9995,2/1/12,Central,Darjeeling,Tea,185,59,39
9996,3/1/12,East,Darjeeling,Tea,88,17,36
9997,8/1/13,Central,Chamomile,Herbal Tea,61,21,21
9998,4/1/12,East,Caffe Mocha,Espresso,124,38,84
9999,5/1/12,West,Darjeeling,Tea,524,150,89

- - - 
## Data Exploration

Here are some common questions that you might want to explore on a dataset like this. They all have in common that they ***can be solved with just one line of code*** in Pandas. That doesn't mean they're trivial – they require you to understand how Pandas works and how you can think about data selection and transformation in Pandas. Sometimes there are also several different ways to achieve the same result. If you can implement a solution that needs more than one line of code, that's also fine – but I'd encourage you to try to find the one-line solution as well, simply in order to learn more about the possibilities that Pandas offers.

If you're lost, don't forget you can reference the [book](https://jakevdp.github.io/PythonDataScienceHandbook/index.html#3.-Data-Manipulation-with-Pandas) or the [user guide](https://pandas.pydata.org/docs/user_guide/).

**1. Does the dataset have any missing values?** Write an expression to obtain a _single boolean value_ (i.e., True or False) that signifies whether the DataFrame has any missing values or not.

In [3]:
df.isnull().any().any()

False

**2. What different _product types_ are there in the dataset?** Produce a list of all unique product types in the dataset, i.e., unique values in the "Product Type" column.

In [4]:
df["Product Type"].unique().tolist()

['Coffee', 'Espresso', 'Tea', 'Herbal Tea']

**3. What different _"coffee" products_ are there in the dataset?** Produce a list of all unique coffee products in the dataset, i.e., values in the "Product" column where the "Product Type" is "Coffee".

In [5]:
df[df["Product Type"] == "Coffee"]["Product"].unique().tolist()

['Decaf Irish Cream', 'Amaretto', 'Colombian']

**4. What different _"coffee or espresso" products_ are there in the dataset?** Do the same as above, but this time include all products where the "Product Type" is either "Coffee" or "Espresso". Try to figure out how to do this in a single Pandas expression — i.e., how can you select all rows in the dataset that match the required condition?

_Hint:_ You might want to consult ["Indexing and Selecting Data" in the user guide](https://pandas.pydata.org/docs/user_guide/indexing.html).

In [6]:
# The issue here is that the following naive approach raises "ValueError":
# df[df["Product Type"] in ("Coffee", "Espresso")]

# Alternative 1:
df[df["Product Type"].isin(("Coffee", "Espresso"))]["Product"].unique().tolist()

# Alternative 2:
df[(df["Product Type"] == "Coffee") | (df["Product Type"] == "Espresso")][
    "Product"
].unique().tolist()

['Decaf Irish Cream',
 'Decaf Espresso',
 'Caffe Latte',
 'Amaretto',
 'Caffe Mocha',
 'Colombian',
 'Regular Espresso']

**5. Which product type generates the most/the least profit, on average?** Find out the average "Profit" values by "Product Type".

In [7]:
df.groupby("Product Type")["Profit"].mean()

Product Type
Coffee        75.578185
Espresso      58.973007
Herbal Tea    63.212826
Tea           51.126021
Name: Profit, dtype: float64

**6. What's the _distribution_ of profits among all products?** Produce a table that has unique "Product" values (e.g., Amaretto, Caffe Latte, ...) as _rows_, and statistics about the distribution of their "Profit" values (e.g., count, mean, min, max, ...) as _columns_.

_Hint:_ The statistics about distributions can be obtained with the `.describe()` method.

In [8]:
df.groupby("Product")["Profit"].describe()

,count,mean,std,min,25%,50%,75%,max
Product,,,,,,,,
Amaretto,166.0,57.253012,64.472375,-40.0,16.00,33.0,76.75,371.0
Caffe Latte,292.0,46.116438,52.895931,-27.0,14.00,31.0,52.25,315.0
Caffe Mocha,919.0,64.001088,72.437359,-321.0,18.00,41.0,98.50,437.0
Chamomile,998.0,65.584168,65.445196,-117.0,21.00,40.0,100.75,432.0
Colombian,101.0,246.247525,91.322112,31.0,191.00,236.0,302.00,626.0
Darjeeling,1626.0,49.459410,67.325825,-586.0,13.00,33.0,83.00,283.0
Decaf Espresso,1149.0,59.009574,55.739914,-301.0,22.00,41.0,85.00,329.0
Decaf Irish Cream,3116.0,71.022465,94.051846,-366.0,23.00,42.0,89.00,778.0
Earl Grey,79.0,89.037975,64.629802,-30.0,42.50,86.0,134.00,234.0
Green Tea,9.0,19.444444,31.627168,-18.0,1.00,11.0,19.00,84.0
Lemon,1143.0,63.998250,75.092109,-214.0,18.00,37.0,90.50,448.0
Mint,354.0,53.991525,56.085855,-289.0,18.25,42.0,91.00,277.0
Regular Espresso,48.0,40.041667,82.014778,-33.0,-9.00,-0.5,80.75,357.0

**7. What are the average profits by products _and_ market region?** From the solution to the previous question, we know the mean "Profit" values for each "Product" in the dataset. Now, we want to look at the average profit by _two_ variables: "Product" and "Market". Produce a table that has products as _rows_, markets as _columns_, and the mean profits of the product–market combination as _values_.

_Hint:_ This is a classic use case for [pivot tables](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html).

In [9]:
df.pivot_table("Profit", index="Product", columns="Market")

Market                Central        East       South        West
Product
Amaretto            60.049383   82.205128         NaN   31.173913
Caffe Latte               NaN         NaN   47.673611   44.601351
Caffe Mocha         88.767773   81.796875   55.932308   44.858824
Chamomile           69.342949   33.971014   41.335714   91.442478
Colombian          242.944444  270.711538  208.176471  205.857143
Darjeeling          62.615023   23.073883         NaN   65.239482
Decaf Espresso      68.546256   44.435976   58.074627   64.967391
Decaf Irish Cream   63.816653  167.639286   48.147059   30.064639
Earl Grey          101.370370   11.142857         NaN   93.755556
Green Tea                 NaN   14.750000         NaN   57.000000
Lemon               72.343042   53.606557   38.552301   87.006897
Mint                59.615385   33.471545         NaN   69.259843
Regular Espresso          NaN   40.041667         NaN         NaN

**8. How many instances are there in the dataset of each product–market combination?** If you produced the pivot table for the previous question, you should see that several values in the table are "NaN" (_not a number_). It looks like some combinations of "Product" and "Market" might not exist in the dataset at all. Modify the pivot table from Q7 so that instead of averages, it shows _counts_ (i.e., how many values there are in total), and instead of "NaN" it fills in `0` for the missing combinations.

In [10]:
df.pivot_table(
    "Profit", index="Product", columns="Market", aggfunc="count", fill_value=0
)

Market             Central  East  South  West
Product
Amaretto                81    39      0    46
Caffe Latte              0     0    144   148
Caffe Mocha            211   128    325   255
Chamomile              312   207    140   339
Colombian               18    52     17    14
Darjeeling             426   582      0   618
Decaf Espresso         227   328    134   460
Decaf Irish Cream     1189   560    578   789
Earl Grey               27     7      0    45
Green Tea                0     8      0     1
Lemon                  309   305    239   290
Mint                   104   123      0   127
Regular Espresso         0    48      0     0

- - - 
## Data Preprocessing

So far we just looked at the data in different ways, now we're going to modify it.

**9. Filter out all products where we don't have data from all markets.** In Q8, we saw that some product–market combinations don't appear in the dataset at all. Maybe we want to do an analysis based on products and market regions, and therefore only want to keep products where we have data from _all_ of the four markets. In other words, we want to drop all the products where one of the markets has a count of `0`. Make a new DataFrame `df_subset` that consists of only the rows in `df` which fulfill this criterion.

_Hint:_ This is possible to implement in one line, but it might easier to think about if you define a "helper function" first. This helper function should take a Pandas data structure and return `True` if it contains data from four different markets, and `False` otherwise. Afterwards, you can use this helper function to _filter_ the dataset.

_Hint 2:_ If you implemented the filtering correctly, the resulting `df_subset` should have exactly 2616 rows.

In [11]:
df_subset = df.groupby("Product").filter(lambda x: x["Market"].nunique() == 4)

_Check:_ If you created the column correctly, the following line of code should evaluate to `True`:

In [12]:
len(df_subset) == 7426

True

**10. Make a new column "Profit Above Average" that is `True` when the "Profit" is above the average of the dataset, and `False` otherwise.** Creating new columns can be a useful preprocessing step for further analyses or visualizations. Work with the original `df` here, select all rows where "Profit" is above average, and assign the result to the new column "Profit Above Average".

In [13]:
df["Profit Above Average"] = df["Profit"] > df["Profit"].mean()

_Check:_ If you created the column correctly, the following line of code should evaluate to `True`:

In [14]:
df["Profit Above Average"].sum() == 3401

True

**11. Transform the `Ddate` column into a `datetime` type.** The dataset contains a column `Ddate` which stores a date in month-day-year format. However, it's currently just stored as a string. In order to perform operations based on this date column (for example, grouping or filtering by month), it would be helpful to convert it to a proper Python `datetime` expression. _Transform_ the `Ddate` column from `string` into a `datetime` format.

In [15]:
df["Ddate"] = df["Ddate"].transform(pd.to_datetime)

In [16]:
df["Ddate"]

0      2013-09-01
1      2012-05-01
2      2013-01-01
3      2012-08-01
4      2013-12-01
          ...
9995   2012-02-01
9996   2012-03-01
9997   2013-08-01
9998   2012-04-01
9999   2012-05-01
Name: Ddate, Length: 10000, dtype: datetime64[ns]

_Check:_ If you transformed the column correctly, the following line of code should work and return `True`:

In [17]:
sorted(df["Ddate"].apply(lambda x: x.month).unique()) == list(range(1, 13))

True

**12. Perform min-max scaling on the `Expenses` column.** Some machine learning algorithms are sensitive to the absolute distance between data points. It's therefore sometimes necessary to _reshape_ your data. Here, we want to perform min-max scaling on a column, which means _transforming_ our data to fall within the $[0,1]$ range. In mathematical terms, this means applying the function:

$$
f(x) = \frac{x - \min (x)}{\max (x) - \min (x)}
$$

Perform this transformation on the `Expenses` column.

_Hint:_ Don't try to do this one on one line; you probably want to write a helper function here for clarity.

In [18]:
min_te = df["Expenses"].min()
max_te = df["Expenses"].max()


def min_max(x):
    return (x - min_te) / (max_te - min_te)


df["Expenses"] = df["Expenses"].transform(min_max)

_Check:_ If you transformed the column correctly, the following line of code should evaluate to `True`:

In [19]:
df["Expenses"].aggregate([min, max]).tolist() == [0.0, 1.0] and (
    0.19 < df["Expenses"].median() < 0.21
)

True

- - - 
## Combining Datasets

The dataset we looked at contains data for the years 2012 and 2013. Let's assume we're getting additional data for the years 2014/2015 later, and want to merge these with the first dataset.  Since we modified the original dataset a lot in the exercises above, let's first reload it here, and then load the new "extra" dataset:

In [20]:
df = pd.read_csv(data)
df_extra = pd.read_csv("data/coffee-chain-extra.csv")
df_extra

        Ddate   Market            Product  Sales  Profit  Expenses
0      5/1/15    South        Caffe Mocha    231      67        54
1      2/1/15  Central  Decaf Irish Cream    319     136        85
2      7/1/14  Central         Darjeeling    251     133        59
3      5/1/14     East     Decaf Espresso    194     142        55
4     10/1/14  Central  Decaf Irish Cream    192     103        49
...       ...      ...                ...    ...     ...       ...
4995   4/1/14     East              Lemon     77      -8        73
4996   5/1/14     West     Decaf Espresso    105      41        20
4997   2/1/14     West        Caffe Mocha    116     -34        27
4998   2/1/14  Central  Decaf Irish Cream    119      36        42
4999   9/1/15     West              Lemon    144      28        41

[5000 rows x 6 columns]

**13. Concatenate the two datasets `df` and `df_extra` into a DataFrame `df_new`,** making sure that the new, concatenated dataset **has no duplicate indices.** The result should be a DataFrame with 15,000 rows that has a numerical index (like our original datasets) from 0 to 14,999.

In [21]:
df_new = pd.concat([df, df_extra], ignore_index=True)

_Check:_ If you created the DataFrame correctly, the following should evaluate to `True`:

In [22]:
(len(df_new) == 15000) and (14999 in df_new.index)

True

- - -

Sometimes, we want to combine two datasets that have complementary information, i.e., different columns. For example, let's say we have this tiny dataset containing additional information about "Market Size" for each of our four markets:

In [23]:
df_markets = pd.DataFrame.from_dict(
    {
        "Market": ["Central", "East", "West", "South"],
        "Market Size": ["Major", "Major", "Major", "Minor"],
    }
)
df_markets

    Market Market Size
0  Central       Major
1     East       Major
2     West       Major
3    South       Minor

**14. Merge `df_new` with `df_markets`.** The resulting DataFrame should look just like `df_new`, but have an extra column "Market Size" whose value depends on the "Market" value of the given row.

In [24]:
pd.merge(
    df_new, df_markets, "left", on="Market"
)  # on="Market" is actually optional here

,Ddate,Market,Product,Product Type,Sales,Profit,Expenses,Market Size
0,9/1/13,Central,Decaf Irish Cream,Coffee,90,36,37,Major
1,5/1/12,East,Decaf Espresso,Espresso,203,56,55,Major
2,1/1/13,West,Caffe Latte,Espresso,524,136,93,Major
3,8/1/12,West,Earl Grey,Tea,273,81,68,Major
4,12/1/13,West,Amaretto,Coffee,201,-3,68,Major
...,...,...,...,...,...,...,...,...
14995,4/1/14,East,Lemon,NaN,77,-8,73,Major
14996,5/1/14,West,Decaf Espresso,NaN,105,41,20,Major
14997,2/1/14,West,Caffe Mocha,NaN,116,-34,27,Major
14998,2/1/14,Central,Decaf Irish Cream,NaN,119,36,42,Major
14999,9/1/15,West,Lemon,NaN,144,28,41,Major

**15. Fill in missing data in the `Product Type` column.** You might have noticed that the `df_extra` dataset we loaded above is missing a column that the original `df` had: the "Product Type"!  Luckily, this information can be easily recovered, as the "Product Type" can be uniquely deduced from the "Product" (e.g., a "Darjeeling" product is always a "Tea"). However, the process to get there may be a little bit tricky.

_Hint:_ First, try to get a DataFrame that has all unique `(Product, Product Type)` combinations. Then, you should be able to merge this with `df_extra`.

In [25]:
df_extra.merge(df[["Product", "Product Type"]].drop_duplicates(), "left")

,Ddate,Market,Product,Sales,Profit,Expenses,Product Type
0,5/1/15,South,Caffe Mocha,231,67,54,Espresso
1,2/1/15,Central,Decaf Irish Cream,319,136,85,Coffee
2,7/1/14,Central,Darjeeling,251,133,59,Tea
3,5/1/14,East,Decaf Espresso,194,142,55,Espresso
4,10/1/14,Central,Decaf Irish Cream,192,103,49,Coffee
...,...,...,...,...,...,...,...
4995,4/1/14,East,Lemon,77,-8,73,Herbal Tea
4996,5/1/14,West,Decaf Espresso,105,41,20,Espresso
4997,2/1/14,West,Caffe Mocha,116,-34,27,Espresso
4998,2/1/14,Central,Decaf Irish Cream,119,36,42,Coffee
4999,9/1/15,West,Lemon,144,28,41,Herbal Tea

- - - 
## Slightly harder bonus challenges

**16. Make a new column "Top within Product" that is `True` when the "Profit" is within the top 25% of its "Product" category.**

_Hints:_

1. Find the cutoff value for the top 25% in each "Product" category, and store this in a variable. (A keyword to look out for when obtaining the "top 25%" is _quantiles_...)
2. Write a function that takes a Pandas Series and returns `True` if its "Profit" value is higher than the cutoff value for its "Product" category.
3. [Apply](https://pandas.pydata.org/docs/user_guide/basics.html#row-or-column-wise-function-application) this function to each row of `df` to get your new column.

In [26]:
cutoffs = df.groupby("Product")["Profit"].quantile(0.75)
is_above_cutoff = lambda x: x["Profit"] >= cutoffs[x["Product"]]
df["Top within Product"] = df.apply(is_above_cutoff, axis=1)

_Check:_ If you created the column correctly, the following line of code should evaluate to `True`:

In [27]:
df["Top within Product"].sum() == 2518

True

**17. Try to do the same as in Q15, but with `df_new`.** In other words, try to fill in the `NaN` values in the "Product Type" after you have already merged `df` and `df_extra` together. This can be quite tricky, and there are many possible ways to approach this.

In [28]:
df_products = df[["Product", "Product Type"]].drop_duplicates()
df_new.combine_first(df_new[["Product"]].merge(df_products, "left"))

,Ddate,Expenses,Market,Product,Product Type,Profit,Sales
0,9/1/13,37,Central,Decaf Irish Cream,Coffee,36,90
1,5/1/12,55,East,Decaf Espresso,Espresso,56,203
2,1/1/13,93,West,Caffe Latte,Espresso,136,524
3,8/1/12,68,West,Earl Grey,Tea,81,273
4,12/1/13,68,West,Amaretto,Coffee,-3,201
...,...,...,...,...,...,...,...
14995,4/1/14,73,East,Lemon,Herbal Tea,-8,77
14996,5/1/14,20,West,Decaf Espresso,Espresso,41,105
14997,2/1/14,27,West,Caffe Mocha,Espresso,-34,116
14998,2/1/14,42,Central,Decaf Irish Cream,Coffee,36,119
14999,9/1/15,41,West,Lemon,Herbal Tea,28,144